Project/Toir/src/Documents/гкс_ЕВОБланк/гкс_ЕВОБланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЕВОБланк</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.гкс_ОжидаемыеМероприятияЕвобланк</registerRecords>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорневойПричины</name>
    <type>
      <types>CatalogRef.гкс_ТипыКорневыхПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВызоваТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПринятые</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричинаТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазборТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕвоБланкПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОстанова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникСмены</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаграммаСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроблем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>EnumRef.гкс_ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПовторныйОтказ</name>
    <comment>TOIR20-534</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияПоПредупреждению</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>TOIR20-462</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АнализПричины</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорневаяПричина</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Documents/гкс_ЕВОБланк/Forms/ПоискКорневойПричины/Module.bsl
&НаКлиенте
Процедура ТабДокВыбор(Элемент, Область, СтандартнаяОбработка)
	Попытка
		ЧислоИД = Число(Область.Имя);
	Исключение
		Возврат;
	КонецПопытки;
	НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", ЧислоИД));
	Если НайдСтр.Количество() Тогда 
		// активизировать
		АктивныйИД = ЧислоИД;
		ПерестроитьТаблицу();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МаксимальныйИД = 1;
	Для Каждого СТ Из Параметры.АнализПричины Цикл
		НС = АнализПричины.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СТ);
		МаксимальныйИД = Макс(МаксимальныйИД, СТ.ИД);
	КонецЦикла;
	Для Каждого СТ Из АнализПричины Цикл
		Если СТ.ИД = 0 Тогда 
			МаксимальныйИД = МаксимальныйИД + 1;
			СТ.ИД = МаксимальныйИД;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВвод(Команда)
	Ответ = Новый Массив();
	Для Каждого СТ Из АнализПричины Цикл
		ТемпСтрукт = Новый Структура("ИД,РодительИД,Причина,КорневаяПричина");
		ЗаполнитьЗначенияСвойств(ТемпСтрукт, СТ);
		Ответ.Добавить(ТемпСтрукт);
	КонецЦикла;
	Закрыть(Ответ);
КонецПроцедуры

&НаКлиенте
Процедура ПерестроитьТаблицу()
	Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	ТабДок = Новый ТабличныйДокумент();
	ТабДок.Область(1,1,1,1).ШиринаКолонки = 5;
	Блок0 = ТабДок.Область(1,2,1,2);
	Блок0.ШиринаКолонки = 40;
	Блок0.Текст = "Причины";
	Блок0.Обвести(Линия1, Линия1, Линия1, Линия1);
	Для Сч = 1 По 5 Цикл
		ТабДок.Область(1, 2 + Сч * 2, 1, 2 + Сч * 2).ШиринаКолонки = 40;
		ТабДок.Область(1, 1 + Сч * 2, 1, 1 + Сч * 2).ШиринаКолонки = 10;
	КонецЦикла;
	Блок2 = ТабДок.Область(1,3,1,12);
	Блок2.Текст = "5 Почему";
	Блок2.Объединить();
	Блок2.Обвести(Линия1, Линия1, Линия1, Линия1);
	//
	НомерПП = 2;
	СтрокиКорня = ПолучитьДеревоПричин(0, 0);	
	ПостроитьТаблицуПричин(СтрокиКорня, 2, 2);
	// размещение текста с переносом сделать
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПерестроитьТаблицу();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДеревоПричин(РодительИД, Уровень)	
	МассивОтвета = Новый Массив();
	Если Уровень > 6 Тогда 
		Возврат МассивОтвета;
	КонецЕсли;
	СтрокиКорня = АнализПричины.НайтиСтроки(Новый Структура("РодительИД", РодительИД));
	Для Каждого СТ Из СтрокиКорня Цикл
		СТ.Уровень = Уровень;
		ЭтиСтроки = ПолучитьДеревоПричин(СТ.ИД, Уровень + 1);
		Если ЭтиСтроки.Количество() Тогда 
			Высота = 0;
			Для Каждого СМ ИЗ ЭтиСтроки Цикл
				Высота = СМ.Высота + Высота;
			КонецЦикла;
		Иначе
			Высота = 1;
		КонецЕсли;
		ТемпСтрукт = Новый Структура("Текст,ИД,ЭтиСтроки", СТ.Причина, СТ.ИД, ЭтиСтроки);
		ТемпСтрукт.Вставить("Высота", Высота);
		ТемпСтрукт.Вставить("Уровень", Уровень);
		ТемпСтрукт.Вставить("КорневаяПричина", СТ.КорневаяПричина);
		МассивОтвета.Добавить(ТемпСтрукт);
	КонецЦикла;
	Возврат МассивОтвета;
КонецФункции

&НаКлиенте
Процедура ПостроитьТаблицуПричин(СтрокиКорня, НСтроки, НСтолбца)
	Линия1 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	Линия2 = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 3);
	НомерПП = НСтроки;
	Для Каждого СТ Из СтрокиКорня Цикл
		//вывод текущей
		Блок2 = ТабДок.Область(НомерПП, НСтолбца, НомерПП + СТ.Высота - 1, НСтолбца);
		Блок2.Текст = СТ.Текст;
		Блок2.Имя = Формат(СТ.ИД, "ЧГ=");
		Блок2.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Блок2.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		Блок2.Объединить();
		Если СТ.ИД = АктивныйИД Тогда 
			Блок2.Обвести(Линия2, Линия2, Линия2, Линия2);
		Иначе
			Блок2.Обвести(Линия1, Линия1, Линия1, Линия1);
		КонецЕсли;
		Если СТ.КорневаяПричина Тогда 
			Блок2.ЦветФона = WebЦвета.Желтый;
		КонецЕсли;
		Если НСтолбца > 2 Тогда 
			Блок1 = ТабДок.Область(НомерПП, НСтолбца - 1, НомерПП + СТ.Высота - 1, НСтолбца - 1);
			Блок1.Текст = Строка(СТ.Уровень) + " почему";
			Блок1.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			Блок1.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			Блок1.Объединить();
			Блок1.Обвести(Линия1, Линия1, Линия1, Линия1);
		КонецЕсли;
		// вывод подчиненных
		ПостроитьТаблицуПричин(СТ.ЭтиСтроки, НомерПП, НСтолбца + 2);
		НомерПП = НомерПП + СТ.Высота;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПричину(Команда)
	ОпОп = Новый ОписаниеОповещения("ДобавитьПричинуПослеВвода", ЭтотОбъект);
	ПоказатьВводСтроки(ОпОп, "", "Введите причину", 300);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПричинуПослеВвода(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено И ЗначениеЗаполнено(Результат) Тогда 
		МаксимальныйИД = МаксимальныйИД + 1;
		НС = АнализПричины.Добавить();
		НС.Причина = Результат;
		НС.ИД = МаксимальныйИД;
		АктивныйИД = НС.ИД;
		//
		ПерестроитьТаблицу();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьПочему(Команда)
	Если АктивныйИД = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите ячейку двойным нажатием";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", АктивныйИД));
	Если НайдСтр.Количество() Тогда 
		НС = НайдСтр[0];
		Если НС.Уровень > 4 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Достигнута максимальная глубина причин";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка таблицы. ячейка не найдена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	ОпОп = Новый ОписаниеОповещения("ДобавитьПочемуПослеВвода", ЭтотОбъект);
	ПоказатьВводСтроки(ОпОп, "", "Введите причину", 300);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПочемуПослеВвода(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено И ЗначениеЗаполнено(Результат) Тогда 
		МаксимальныйИД = МаксимальныйИД + 1;
		НС = АнализПричины.Добавить();
		НС.Причина = Результат;
		НС.ИД = МаксимальныйИД;
		НС.РодительИД = АктивныйИД;
		//
		ПерестроитьТаблицу();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКП(Команда)
	Если АктивныйИД = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите ячейку двойным нажатием";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", АктивныйИД));
	Если НайдСтр.Количество() Тогда 
		НС = НайдСтр[0];
		Если НС.Уровень = 0 Тогда 
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Нельзя выбрать причину";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		НайдСтрСтарые = АнализПричины.НайтиСтроки(Новый Структура("КорневаяПричина", Истина));
		Для Каждого СтараяСтрока ИЗ НайдСтрСтарые Цикл
			СтараяСтрока.КорневаяПричина = Ложь;
		КонецЦикла;
		НС.КорневаяПричина = Истина;
		ПерестроитьТаблицу();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка таблицы. ячейка не найдена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьПричину(Команда)
	Если АктивныйИД = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите ячейку двойным нажатием";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", АктивныйИД));
	Если НайдСтр.Количество() Тогда 
		УдалитьПодчиненныеСтроки(АктивныйИД);
		//
		АнализПричины.Удалить(НайдСтр[0]);
		//
		ПерестроитьТаблицу();
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка таблицы. ячейка не найдена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПодчиненныеСтроки(ИД)
	МассивУдаления = АнализПричины.НайтиСтроки(Новый Структура("РодительИД", ИД));
	Для Каждого СМ Из МассивУдаления Цикл
		УдалитьПодчиненныеСтроки(СМ.ИД);
		//
		АнализПричины.Удалить(СМ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Переименовать(Команда)
	Если АктивныйИД = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Выберите ячейку двойным нажатием";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", АктивныйИД));
	Если НайдСтр.Количество() Тогда 
		НС = НайдСтр[0];
		ОпОп = Новый ОписаниеОповещения("ПереименоватьПослеВвода", ЭтотОбъект);
		ПоказатьВводСтроки(ОпОп, НС.Причина, "Введите причину", 300);
	Иначе
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка таблицы. ячейка не найдена";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПереименоватьПослеВвода(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено И ЗначениеЗаполнено(Результат) Тогда 
		НайдСтр = АнализПричины.НайтиСтроки(Новый Структура("ИД", АктивныйИД));
		Если НайдСтр.Количество() Тогда 
			НС = НайдСтр[0];
			НС.Причина = Результат;
			//
			ПерестроитьТаблицу();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
